spec/fixtures/requests/query_device_info/dec_unsigned_soap.xml

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:v2="http://integration.sprint.com/common/header/WSMessageHeader/v2"
xmlns:sub="http://integration.sprint.com/interfaces/wholesaleValidateDevice/v3/wholesaleValidateDeviceV3.xsd">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
</wsse:Security>
<v2:wsMessageHeader>
<v2:trackingMessageHeader>
<v2:applicationId>2222333344</v2:applicationId>
<v2:applicationUserId>BEQUICK</v2:applicationUserId>
<v2:messageId>9999999999</v2:messageId>
<v2:timeToLive>0</v2:timeToLive>
<v2:messageDateTimeStamp>2014-01-01T00:00:00.0Z</v2:messageDateTimeStamp>
</v2:trackingMessageHeader>
</v2:wsMessageHeader>
</soapenv:Header>
<soapenv:Body>
<sub:wholesaleValidateDeviceV3>
<sub:deviceInfo>
<sub:deviceDetailInfo>
<sub:esnMeidDec>123456789012345678</sub:esnMeidDec>
</sub:deviceDetailInfo>
<sub:iccId>89011200000403604860</sub:iccId>
</sub:deviceInfo>
<sub:resellerPartnerId>2222333344</sub:resellerPartnerId>
</sub:wholesaleValidateDeviceV3>
</soapenv:Body>
</soapenv:Envelope>
