test.html

<html>
<script src="https://cdn.jsdelivr.net/npm/easy-soap-request@2.3.5/dist/easy-soap-request.js"></script>
<script>
    const url = 'https://webservicesgateway.sprint.com:444/services/mvno/WholesaleQueryDeviceInfoService/v1';
    const headers = {
        'Content-Type': 'text/xml;charset=UTF-8',
        SOAPAction: 'WholesaleValidateDeviceV3',
    };
    var $header=`<soapenv:Header>
     <m:wsMessageHeader xmlns:m="http://integration.sprint.com/common/header/WSMessageHeader/v2">
        <m:trackingMessageHeader>
           <m:applicationId>2015080801</m:applicationId>
           <m:applicationUserId>HTH Communication</m:applicationUserId>
           <!--Optional:-->
           <m:consumerId>87ULL</m:consumerId>
           <m:messageId>kTYpkpvKgddg:MNUPZ,CCbbb9:B8Jtt</m:messageId>
           <!--Optional:-->
           <m:conversationId>20190221R039489529745</m:conversationId>
           <m:timeToLive>60</m:timeToLive>
           <!--Optional:
           <m:replyCompletionCode>?</m:replyCompletionCode>-->
           <m:messageDateTimeStamp>2019-09-09T07:51:52.839-08:00</m:messageDateTimeStamp>
        </m:trackingMessageHeader>
     </m:wsMessageHeader>
  </soapenv:Header>`;

    var $requests = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:m="http://integration.sprint.com/common/header/WSMessageHeader/v2" xmlns:whol="http://integration.sprint.com/interfaces/wholesaleValidateDevice/v3/wholesaleValidateDeviceV3.xsd">` + $header + `
         <soapenv:Body>
          <whol:wholesaleValidateDeviceV3>
             <whol:deviceInfo>
                <whol:deviceDetailInfo>
                   <whol:esnMeidDec>270113180109643752</whol:esnMeidDec>
                </whol:deviceDetailInfo>
             </whol:deviceInfo>
             <whol:resellerPartnerId>2015080801</whol:resellerPartnerId>
          </whol:wholesaleValidateDeviceV3>
       </soapenv:Body>
    </soapenv:Envelope>`;
    const xml = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://wwg/2001/XMLSchema-instance">
                 <soapenv:Header/>
                 <soapenv:Body>Some Data</soapenv:Body>
                 </soapenv:Envelope>`;
    async function makeRequest() {
        const { response } = await soapRequest(url, headers, $requests, 100000); // Optional timeout parameter(milliseconds)
        const { body, statusCode } = response;
        console.log(body);
        console.log(statusCode);
        document.body.innerHTML = body;
    };
    makeRequest();
</script>
<body></body>
</html>